{
  "greetings": {
    "hello": "Hi there! How can I help you today?",
    "hi": "Hello! What can I assist you with?",
    "congrats": " For what, congrats ? ",
    "hey": "Hey there! How can I be of service?",
    "good morning": "Good morning! Wishing you a productive day!",
    "good afternoon": "Good afternoon! How's your day going?",
    "good evening": "Good evening! How can I assist you tonight?",
    "how are you": "I'm doing well, thanks for asking! How about you?",
    "what's up": "Not much, just here to help you! What's on your mind?",
    "nice to meet you": "Nice to meet you too! How can I assist you today?",
    "goodbye": "Goodbye! Feel free to chat again whenever you need help.",
    "bye": "Bye! Have a great day!",
    "see you later": "See you later! Come back anytime.",
    "thanks": "You're welcome! Is there anything else I can help with?",
    "thank you": "You're welcome! Happy to help.",
    "how's it going": "I'm doing well! Ready to assist you with any questions.",
    "what can you do": "I can answer questions about various topics including coding, health, education, and more. Just ask away!",
    "who are you": "I'm your friendly AI assistant, designed to help with information and answer your questions.",
    "what's your name": "I'm your AI assistant, here to help with your questions and tasks.",
    "how do you work": "I process your questions and try to match them with my knowledge base to provide helpful answers.",
    "tell me about yourself": "I'm an AI assistant designed to provide information and answer questions across various topics."
  },
  "health_wellness": {
    "how to stay healthy": "Stay healthy by eating a balanced diet, exercising regularly, getting enough sleep, staying hydrated, and managing stress.",
    "tips for better sleep": "For better sleep: maintain a regular schedule, avoid screens before bed, create a comfortable environment, limit caffeine, and try relaxation techniques.",
    "how much water should i drink": "Generally, aim for about 8 glasses (2 liters) of water daily, but needs vary based on activity level, climate, and individual factors.",
    "healthy snack ideas": "Healthy snacks include fruit, nuts, yogurt, hummus with veggies, hard-boiled eggs, and whole grain crackers with cheese.",
    "how to reduce stress": "Reduce stress through regular exercise, meditation, deep breathing, adequate sleep, time management, and engaging in activities you enjoy.",
    "benefits of exercise": "Exercise improves cardiovascular health, strengthens muscles, enhances mood, boosts energy, improves sleep, and helps maintain healthy weight.",
    "how to start exercising": "Start with short, enjoyable activities like walking, gradually increase duration and intensity, and aim for consistency rather than perfection.",
    "headache remedies": "For headaches: stay hydrated, rest in a dark quiet room, try cold/hot compresses, consider over-the-counter pain relievers, and practice stress management.",
    "how to improve posture": "Improve posture by being mindful of alignment, strengthening core muscles, taking regular breaks from sitting, and setting up an ergonomic workspace.",
    "eye strain prevention": "Prevent eye strain by following the 20-20-20 rule: every 20 minutes, look at something 20 feet away for 20 seconds, and ensure proper lighting.",
    "healthy breakfast ideas": "Healthy breakfasts include oatmeal with fruit, Greek yogurt with granola, whole grain toast with avocado, or a vegetable omelet.",
    "benefits of meditation": "Meditation reduces stress, improves focus, enhances emotional health, lengthens attention span, and may help with anxiety and depression.",
    "how to meditate": "Start meditation by sitting comfortably, focusing on your breath, observing thoughts without judgment, and practicing for just a few minutes daily.",
    "signs of dehydration": "Dehydration signs include thirst, dark urine, fatigue, dizziness, dry mouth/skin, headache, and decreased urination.",
    "how to boost immunity": "Boost immunity by eating nutrient-rich foods, getting adequate sleep, exercising regularly, managing stress, and staying hydrated.",
    "benefits of yoga": "Yoga improves flexibility, strength, posture, reduces stress, enhances mental clarity, and can help with pain management.",
    "how to maintain weight": "Maintain weight through balanced nutrition, portion control, regular physical activity, adequate sleep, and stress management.",
    "healthy lunch ideas": "Healthy lunches include salads with protein, grain bowls, vegetable soup with whole grain bread, or wraps with lean protein and vegetables.",
    "benefits of walking": "Walking improves cardiovascular health, maintains weight, strengthens bones, enhances muscle endurance, and boosts mood and energy.",
    "how to improve digestion": "Improve digestion by eating fiber-rich foods, staying hydrated, exercising regularly, managing stress, and eating mindfully."
  },
  "mental_wellness": {
    "how to stay motivated": "Stay motivated by setting clear goals, breaking them into smaller tasks, celebrating progress, finding accountability partners, and remembering your purpose.",
    "dealing with stress": "Deal with stress by practicing mindfulness, regular exercise, adequate sleep, time management, and connecting with supportive people.",
    "how to focus better": "Improve focus by minimizing distractions, taking regular breaks, getting enough sleep, staying hydrated, and practicing mindfulness techniques.",
    "overcoming procrastination": "Overcome procrastination by breaking tasks into smaller steps, setting deadlines, eliminating distractions, and using time management techniques.",
    "building confidence": "Build confidence by acknowledging strengths, setting achievable goals, practicing positive self-talk, stepping outside comfort zones, and celebrating successes.",
    "managing anxiety": "Manage anxiety through deep breathing, regular exercise, adequate sleep, limiting caffeine and alcohol, and considering professional support if needed.",
    "improving self-esteem": "Improve self-esteem by practicing self-compassion, setting boundaries, focusing on strengths, challenging negative thoughts, and surrounding yourself with positive influences.",
    "dealing with failure": "Handle failure by viewing it as a learning opportunity, practicing self-compassion, analyzing what went wrong, adjusting your approach, and persisting.",
    "finding purpose": "Find purpose by exploring interests, identifying values, setting meaningful goals, helping others, and reflecting on what brings fulfillment.",
    "staying positive": "Stay positive by practicing gratitude, surrounding yourself with supportive people, focusing on solutions rather than problems, and engaging in activities you enjoy.",
    "overcoming fear": "Overcome fear by facing it gradually, challenging irrational thoughts, visualizing success, practicing relaxation techniques, and celebrating small victories.",
    "building resilience": "Build resilience by developing problem-solving skills, maintaining perspective, practicing self-care, nurturing social connections, and finding meaning in challenges.",
    "dealing with burnout": "Address burnout by setting boundaries, prioritizing self-care, seeking support, taking breaks, and reassessing priorities and commitments.",
    "improving mindfulness": "Practice mindfulness by focusing on the present moment, engaging fully in activities, observing thoughts without judgment, and regular meditation.",
    "boosting creativity": "Boost creativity by exposing yourself to new experiences, allowing time for reflection, embracing curiosity, and stepping away from problems occasionally.",
    "handling criticism": "Handle criticism by listening objectively, focusing on growth opportunities, separating self-worth from feedback, and responding rather than reacting.",
    "finding balance": "Find balance by setting priorities, establishing boundaries, scheduling time for various life aspects, practicing self-care, and regularly reassessing.",
    "overcoming self-doubt": "Overcome self-doubt by challenging negative thoughts, focusing on past successes, seeking feedback, setting achievable goals, and practicing self-compassion.",
    "staying calm under pressure": "Stay calm under pressure through deep breathing, maintaining perspective, focusing on what you can control, preparation, and regular stress management.",
    "developing emotional intelligence": "Develop emotional intelligence by practicing self-awareness, empathy, active listening, managing emotions, and reflecting on interactions."
  },
  "coding": {
    "what is html": "HTML (HyperText Markup Language) is the standard language for creating web pages. It uses tags to structure content on the web.",
    "what is css": "CSS (Cascading Style Sheets) is a language used to style HTML elements, controlling layout, colors, fonts, and the overall appearance of web pages.",
    "what is javascript": "JavaScript is a programming language that enables interactive web pages. It runs in the browser and can update content, control multimedia, and animate elements.",
    "what is python": "Python is a high-level, interpreted programming language known for its readability, simplicity, and versatility across web development, data science, AI, and more.",
    "what is c++": "C++ is a powerful, general-purpose programming language that extends C with object-oriented features. It's used for system/software development, game development, and more.",
    "what is recursion": "Recursion is when a function calls itself to solve smaller instances of the same problem, requiring a base case to prevent infinite recursion.",
    "what are data structures": "Data structures are specialized formats for organizing, processing, retrieving, and storing data, such as arrays, linked lists, stacks, queues, trees, and graphs.",
    "explain arrays": "Arrays are ordered collections of items stored at contiguous memory locations, allowing efficient element access using indices, starting from 0 in most languages.",
    "what is a linked list": "A linked list is a linear data structure where elements are stored in nodes containing data and a reference to the next node, allowing dynamic size changes.",
    "what is a stack": "A stack is a linear data structure following Last-In-First-Out (LIFO) principle, with operations like push (add) and pop (remove) performed only at one end.",
    "what is a queue": "A queue is a linear data structure following First-In-First-Out (FIFO) principle, where elements are added at the rear and removed from the front.",
    "what is object-oriented programming": "Object-Oriented Programming (OOP) is a programming paradigm based on objects containing data and methods, with principles like encapsulation, inheritance, and polymorphism.",
    "what is a function": "A function is a reusable block of code designed to perform a specific task, accepting inputs (parameters) and returning outputs, promoting code organization and reuse.",
    "what is an algorithm": "An algorithm is a step-by-step procedure or formula for solving a problem, with characteristics like definiteness, finiteness, effectiveness, and generality.",
    "what is big o notation": "Big O Notation describes an algorithm's performance or complexity by how its runtime or space requirements grow relative to input size, focusing on worst-case scenarios.",
    "what is a variable": "A variable is a named storage location in a program that holds a value which can be changed during execution, with a specific data type in many languages.",
    "what is a loop": "A loop is a programming construct that repeats a block of code until a specified condition is met, with common types being for, while, and do-while loops.",
    "what is a conditional statement": "Conditional statements (like if-else) allow programs to execute different code blocks based on whether specified conditions evaluate to true or false.",
    "what is a database": "A database is an organized collection of structured data, typically stored electronically, designed for efficient data retrieval, updating, and management.",
    "what is api": "An API (Application Programming Interface) is a set of rules and protocols that allows different software applications to communicate with each other.",
    "what is html5": "HTML5 is the latest version of HTML, introducing new elements and attributes for modern web development, including semantic tags, multimedia support, and canvas for graphics.",
    "what is css flexbox": "CSS Flexbox is a layout model that allows responsive elements within a container to be automatically arranged depending on viewport or device screen size.",
    "what is css grid": "CSS Grid is a two-dimensional layout system for the web, allowing precise control over rows and columns, and placement of items within the grid.",
    "what is responsive design": "Responsive design is an approach to web design that makes web pages render well on various devices and window/screen sizes using fluid grids and flexible images.",
    "what is dom": "The DOM (Document Object Model) is a programming interface for web documents, representing the page as nodes and objects that can be manipulated with languages like JavaScript.",
    "what is json": "JSON (JavaScript Object Notation) is a lightweight data interchange format that's easy for humans to read/write and machines to parse/generate, often used in web applications.",
    "what is http": "HTTP (Hypertext Transfer Protocol) is the foundation of data communication on the web, defining how messages are formatted and transmitted between web servers and browsers.",
    "what is git": "Git is a distributed version control system for tracking changes in source code during software development, facilitating collaboration among multiple developers.",
    "what is github": "GitHub is a web-based platform that uses Git for version control, providing hosting for software development and collaboration features like issue tracking and pull requests.",
    "what is front-end development": "Front-end development focuses on creating the user interface and user experience of websites/applications using HTML, CSS, and JavaScript.",
    "what is back-end development": "Back-end development involves server-side logic, databases, and application integration, using languages like Python, Java, or Node.js to power the application.",
    "what is full-stack development": "Full-stack development encompasses both front-end and back-end development, with developers working on all aspects of web application creation.",
    "what is debugging": "Debugging is the process of finding and resolving defects or problems within a program that prevent correct operation, using various tools and techniques.",
    "what is a framework": "A framework is a platform for developing software applications, providing standard structure and tools to streamline development and avoid writing repetitive code.",
    "what is react": "React is a JavaScript library for building user interfaces, particularly single-page applications, using a component-based architecture for efficient updates and rendering.",
    "what is node.js": "Node.js is a JavaScript runtime built on Chrome's V8 engine, allowing execution of JavaScript code server-side to build scalable network applications.",
    "what is sql": "SQL (Structured Query Language) is a domain-specific language for managing and manipulating relational databases, used for tasks like querying, updating, and managing data.",
    "what is nosql": "NoSQL databases are non-relational databases designed for distributed data stores with large data storage needs, offering flexible schemas unlike traditional SQL databases.",
    "what is mvc": "MVC (Model-View-Controller) is a software design pattern that separates an application into three interconnected components for efficient code organization and maintenance."
  },
  "education_career": {
    "how to study effectively": "Study effectively by creating a dedicated space, using active learning techniques, taking breaks, varying study methods, teaching others, and getting adequate sleep.",
    "time management tips": "Manage time by prioritizing tasks, breaking work into chunks, using a planner, minimizing distractions, setting deadlines, and avoiding multitasking.",
    "how to prepare for exams": "Prepare for exams by starting early, organizing material, using active recall, taking practice tests, studying in groups, and maintaining healthy habits.",
    "how to write a resume": "Create a strong resume by highlighting relevant experience, using action verbs, quantifying achievements, tailoring it to the job, and keeping it concise and error-free.",
    "interview tips": "Succeed in interviews by researching the company, practicing common questions, preparing examples of your skills, dressing professionally, and asking thoughtful questions.",
    "how to choose a major": "Choose a major by exploring interests, researching career paths, considering strengths, talking to professionals, taking diverse courses, and reflecting on long-term goals.",
    "how to network": "Network effectively by attending events, joining professional groups, maintaining an online presence, following up with contacts, and offering help before asking for favors.",
    "how to give a presentation": "Give effective presentations by knowing your audience, organizing content clearly, practicing delivery, using visual aids wisely, and engaging with your audience.",
    "how to write a research paper": "Write research papers by selecting a focused topic, conducting thorough research, creating an outline, drafting with clear structure, and revising carefully.",
    "how to improve reading speed": "Improve reading speed by using a pointer, avoiding subvocalization, reading in chunks, practicing regularly, and adjusting techniques based on material difficulty.",
    "how to take better notes": "Take better notes by being selective, using abbreviations, organizing information visually, reviewing promptly, and adapting methods to different subjects.",
    "how to ask for a letter of recommendation": "Request recommendations by asking well in advance, providing relevant information, being specific about the purpose, and following up with thanks.",
    "how to apply for scholarships": "Apply for scholarships by researching opportunities, meeting deadlines, tailoring applications, highlighting achievements, and submitting polished materials.",
    "how to balance work and study": "Balance work and study by creating a realistic schedule, communicating with employers/professors, prioritizing tasks, using time efficiently, and practicing self-care.",
    "how to choose a career path": "Choose a career by assessing interests and strengths, researching industries, gaining relevant experience, seeking mentorship, and remaining open to evolution.",
    "how to prepare for a job fair": "Prepare for job fairs by researching companies, preparing your elevator pitch, bringing resumes, dressing professionally, and planning follow-up strategies.",
    "how to write a cover letter": "Write effective cover letters by addressing specific individuals, connecting your experience to job requirements, showing enthusiasm, and proofreading carefully.",
    "how to negotiate salary": "Negotiate salary by researching market rates, highlighting your value, practicing your approach, considering the total package, and maintaining professionalism.",
    "how to deal with difficult professors": "Handle difficult professors by attending office hours, seeking to understand expectations, remaining professional, documenting communication, and focusing on learning.",
    "how to improve critical thinking": "Develop critical thinking by questioning assumptions, considering multiple perspectives, evaluating evidence, recognizing biases, and practicing logical reasoning."
  },
  "fun_facts": {
    "tell me a joke": "Why don't scientists trust atoms? Because they make up everything!",
    "fun fact": "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly good to eat!",
    "random fact": "Octopuses have three hearts: two pump blood through the gills, while the third pumps it through the body.",
    "tell me a riddle": "I speak without a mouth and hear without ears. I have no body, but I come alive with wind. What am I? Answer: An echo.",
    "interesting fact": "The shortest war in history was between Britain and Zanzibar on August 27, 1896. Zanzibar surrendered after 38 minutes.",
    "tell me a pun": "I was going to tell a time traveling joke, but you didn't like it.",
    "science fact": "If you could fold a piece of paper 42 times, it would reach the moon. Each fold doubles the thickness!",
    "history fact": "The Great Wall of China is not visible from space with the naked eye, contrary to popular belief.",
    "animal fact": "Cows have best friends and get stressed when they're separated from them.",
    "space fact": "A year on Venus is shorter than a day on Venus. It takes Venus 225 Earth days to orbit the sun but 243 Earth days to rotate on its axis.",
    "ocean fact": "The ocean contains about 97% of Earth's water, but less than 5% has been explored.",
    "technology fact": "The first computer programmer was a woman named Ada Lovelace, who wrote the first algorithm for Charles Babbage's Analytical Engine in the 1840s.",
    "food fact": "Chocolate was once used as currency by the Aztecs.",
    "sports fact": "The Olympic Games originally featured competitions in music, poetry and other arts alongside athletic events.",
    "movie fact": "The Wilhelm Scream is a sound effect that has been used in over 400 films since 1951, becoming an inside joke among sound designers.",
    "music fact": "The world's longest concert lasted for 639 hours, performed on a specially built organ in Germany.",
    "language fact": "The longest word in English without a repeated letter is 'uncopyrightable'.",
    "human body fact": "Your brain uses about 20% of your body's total energy, despite only accounting for about 2% of your body weight.",
    "weather fact": "Lightning strikes the Earth about 8.6 million times per day.",
    "art fact": "Leonardo da Vinci could write with one hand while drawing with the other simultaneously."
  },
 "AI-defination" : {
  "What is AI " : "Artificial Intelligense (AI) is the science and Engineering of creating Intelligent Machines That can mimic human cognative functions . Formally AI is defined as The Capabitlity of a machine to perform tasks that would typically require human intelligence ." ,
  "What AI system can make ? " : "Learn from experience , adapt to new inputs , perform reasoning , understand languages , persive environment through sensors , and make decisions or take actions ."
 } ,
 "Cpp-code" : {

    "C++ Basics - What is C++?": "C++ is a high-level programming language that supports procedural and object-oriented programming paradigms. It is widely used for system/software development, game development, and competitive programming.",
    "C++ Basics - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    cout << \"Hello C++\" << endl;\n    return 0;\n}\n```",

    "C++ Basics - What are variables in C++?": "Variables are named storage locations in memory that hold data of a specific type, like int, float, char, and string.",
    "C++ Basic - Example for variables ": "```cpp\n#include <iostream>\n#include <string>\nusing namespace std;\n\nint main() {\n    int age = 18;\n    float pi = 3.14;\n    char grade = 'A';\n    string name = \"Vijay\";\n    cout << \"Name: \" << name << endl;\n    cout << \"Age: \" << age << endl;\n    cout << \"Grade: \" << grade << endl;\n    cout << \"Pi: \" << pi << endl;\n    return 0;\n}\n```",

    "Data Types - Difference between int and float?": "int stores whole numbers without decimals, while float stores numbers with decimal points and fractional parts.",
    "Data Types - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int x = 10;\n    float y = 10.5;\n    cout << \"Integer: \" << x << endl;\n    cout << \"Float: \" << y << endl;\n    return 0;\n}\n```",

    "Operators - Difference between '=' and '=='?": "'=' is assignment, '==' is equality comparison.",
    "Operators - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int x = 5;\n    if(x == 5) {\n        cout << \"x is 5\" << endl;\n    }\n    return 0;\n}\n```",

    "Control Statements - Difference between 'for' and 'while' loop?": "'for' loop is used when the number of iterations is known, while 'while' loop is used when the number of iterations depends on a condition.",
    "Control Statements - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    cout << \"For loop:\" << endl;\n    for(int i=0; i<5; i++) {\n        cout << i << endl;\n    }\n\n    cout << \"While loop:\" << endl;\n    int j = 0;\n    while(j < 5) {\n        cout << j << endl;\n        j++;\n    }\n    return 0;\n}\n```",

    "Functions - What is a function in C++?": "A function is a block of code that performs a specific task and can be called multiple times in a program. It can have parameters and return values.",
    "Function - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint add(int a, int b) {\n    return a + b;\n}\n\nint main() {\n    int sum = add(5, 3);\n    cout << \"Sum: \" << sum << endl;\n    return 0;\n}\n```",

    "Functions - Difference between void and non-void function?": "A void function does not return any value, whereas a non-void function returns a value of a specified type.",
    "Functions - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nvoid greet() {\n    cout << \"Hello!\" << endl;\n}\n\nint sum(int a, int b) {\n    return a + b;\n}\n\nint main() {\n    greet();\n    cout << \"Sum: \" << sum(4, 5) << endl;\n    return 0;\n}\n```",

    "Arrays - What is an array in C++?": "An array is a collection of elements of the same data type stored in contiguous memory locations. Elements can be accessed using indices.",
    "Arrays - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int arr[5] = {1, 2, 3, 4, 5};\n    for(int i = 0; i < 5; i++) {\n        cout << \"arr[\" << i << \"] = \" << arr[i] << endl;\n    }\n    return 0;\n}\n```",

    "Pointers - What is a pointer in C++?": "A pointer is a variable that stores the memory address of another variable.",
    "Pointers - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int a = 10;\n    int *ptr = &a;\n    cout << \"Value: \" << *ptr << endl;\n    cout << \"Address: \" << ptr << endl;\n    return 0;\n}\n```",

    "Classes & Objects - What is a class in C++?": "A class is a blueprint for creating objects. It can contain data members and member functions to define behavior.",
    "Classes & Objects - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nclass Car {\npublic:\n    string color;\n    void drive() {\n        cout << \"Driving a \" << color << \" car.\" << endl;\n    }\n};\n\nint main() {\n    Car myCar;\n    myCar.color = \"Red\";\n    myCar.drive();\n    return 0;\n}\n```",

    "Inheritance - What is inheritance in C++?": "Inheritance allows a class (derived class) to acquire properties and methods of another class (base class).",
    "Inheritance - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nclass Vehicle {\npublic:\n    void start() {\n        cout << \"Vehicle started\" << endl;\n    }\n};\n\nclass Car : public Vehicle {\n};\n\nint main() {\n    Car c;\n    c.start();\n    return 0;\n}\n```",

    "Polymorphism - What is polymorphism in C++?": "Polymorphism allows objects to take multiple forms. Achieved via function overloading or virtual functions.",
    "Polymorphism - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nclass Base {\npublic:\n    virtual void show() { cout << \"Base\" << endl; }\n};\n\nclass Derived : public Base {\npublic:\n    void show() override { cout << \"Derived\" << endl; }\n};\n\nint main() {\n    Base* b = new Derived();\n    b->show();\n    delete b;\n    return 0;\n}\n```",

    "STL - What is STL in C++?": "STL (Standard Template Library) provides ready-to-use classes and functions for common data structures and algorithms.",
    "STL - Example": "```cpp\n#include <iostream>\n#include <vector>\nusing namespace std;\n\nint main() {\n    vector<int> v = {1,2,3};\n    v.push_back(4);\n    for(int i : v) cout << i << endl;\n    return 0;\n}\n```",

    "File I/O - How to read/write files in C++?": "Use fstream library: ifstream for reading, ofstream for writing.",
    "File I/O - Example": "```cpp\n#include <iostream>\n#include <fstream>\nusing namespace std;\n\nint main() {\n    ofstream outFile(\"test.txt\");\n    outFile << \"Hello File\" << endl;\n    outFile.close();\n\n    ifstream inFile(\"test.txt\");\n    string s;\n    inFile >> s;\n    cout << s << endl;\n    inFile.close();\n    return 0;\n}\n```",

    "Exception Handling - What is exception handling in C++?": "Exception handling is used to handle runtime errors using try, catch, and throw blocks.",
    "Exception Handling - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    try {\n        int x = 0;\n        if(x == 0) throw \"Division by zero!\";\n        int y = 10 / x;\n    } catch(const char* msg) {\n        cout << msg << endl;\n    }\n    return 0;\n}\n```",

    "Dynamic Memory - How to allocate memory dynamically in C++?": "Use 'new' to allocate and 'delete' to free memory.",
    "Dynamic Memory - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int* ptr = new int;\n    *ptr = 10;\n    cout << *ptr << endl;\n    delete ptr;\n    return 0;\n}\n```",

    "References - What are references in C++?": "A reference is an alias for another variable, created using '&'.",
    "References - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nint main() {\n    int x = 10;\n    int& ref = x;\n    ref = 20;\n    cout << x << endl;\n    return 0;\n}\n```",

    "Operator Overloading - What is operator overloading?": "Operator overloading allows defining new behavior for existing operators for user-defined types.",
    "Operator Overloading - Example": "```cpp\n#include <iostream>\nusing namespace std;\n\nclass Complex {\npublic:\n    int real, imag;\n    Complex(int r=0, int i=0) : real(r), imag(i) {}\n    Complex operator + (Complex const &c) {\n        return Complex(real + c.real, imag + c.imag);\n    }\n};\n\nint main() {\n    Complex c1(1,2), c2(3,4);\n    Complex c3 = c1 + c2;\n    cout << c3.real << \"+\" << c3.imag << \"i\" << endl;\n    return 0;\n}\n```"
  }
}

 



